# St7GetHRALoadType

Returns the load type for harmonic response analysis.

long St7GetHRALoadType(long uID, long* LType)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

LType

One of hlBaseAcc, hlBaseVel, hlBaseDisp or hlAppliedLoad.